<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | These lines are used for authentication messages shown to the user.
    |
    */

    'failed' => 'ព័ត៌មានចូលនេះមិនត្រូវគ្នាជាមួយក្នុងប្រព័ន្ធរបស់យើងទេ។',
    'password' => 'ពាក្យសម្ងាត់ដែលបានបញ្ចូលមិនត្រឹមត្រូវទេ។',
    'throttle' => 'អ្នកបានព្យាយាមចូលច្រើនពេក។ សូមព្យាយាមម្ដងទៀតក្នុងរយៈពេល :seconds វិនាទី។',
    'remember-me' => 'ចងចាំខ្ញុំ',
    'forgot-your-password' => 'ភ្លេចពាក្យសម្ងាត់របស់អ្នក?',
    'login' => 'ចូលគណនី',
    'system-info' => 'គម្រោងបញ្ចប់ការសិក្សារបស់យើងគឺជាប្រព័ន្ធគ្រប់គ្រងសាលា ដែលបានបង្កើតឡើងដើម្បីផ្ដល់ដំណោះស្រាយគ្រប់គ្រងសាលាដោយមានប្រសិទ្ធភាព និងពេញលេញ។ គម្រោងមានគោលបំណងធ្វើឲ្យដំណើរការផ្នែករដ្ឋបាល និងសិក្សាកាន់តែងាយស្រួល និងបង្កើនការទំនាក់ទំនងរវាងសាលា គ្រូ ឪពុកម្តាយ និងសិស្ស។',
    'system-name' => 'ប្រព័ន្ធគ្រប់គ្រងសាលា',
    'contact-us' => 'ទាក់ទងមកពួកយើង',
];
