<?php

return [

    //------------------------- Update Profile information form Page ------------------------- //
    'profile-information' => 'ព័ត៌មានផ្ទាល់ខ្លួន',
    'profile-information-update' => 'បញ្ចូលព័ត៌មានផ្ទាល់ខ្លួន និងអ៊ីមែលរបស់អ្នកឡើងវិញ។',
    'photo' => 'រូបភាពផ្ទាល់ខ្លួន',
    'select-photo' => 'ជ្រើសរូបភាពថ្មី',
    'remove-photo' => 'លុបរូបភាព',
    'name' => 'ឈ្មោះ',
    'email' => 'អ៊ីមែល',
    'unverified-email' => 'អ៊ីមែលរបស់អ្នកមិនទាន់បានផ្ទៀងផ្ទាត់ទេ។',
    're-send-verification-email' => 'ចុចទីនេះដើម្បីផ្ញើអ៊ីមែលផ្ទៀងផ្ទាត់ម្ដងទៀត។',
    'new-verification-link' => 'បានផ្ញើតំណភ្ជាប់ផ្ទៀងផ្ទាត់ថ្មីទៅអ៊ីមែលរបស់អ្នក។',
    'saved' => 'បានរក្សាទុក។',
    'save' => 'រក្សាទុក',

    //------------------------ Two Factor Authentication form Page ----------------------------- //
    'two-factor-auth' => 'ការផ្ទៀងផ្ទាត់ពីរជាន់',
    'add-security' => 'បន្ថែមសុវត្ថិភាពបន្ថែមទៅគណនីរបស់អ្នកដោយប្រើការផ្ទៀងផ្ទាត់ពីរជាន់។',
    'finish-enabling' => 'បញ្ចប់ការបើកការផ្ទៀងផ្ទាត់ពីរជាន់។',
    'enabled' => 'អ្នកបានបើកការផ្ទៀងផ្ទាត់ពីរជាន់រួចហើយ។',
    'not-enabled' => 'អ្នកមិនទាន់បានបើកការផ្ទៀងផ្ទាត់ពីរជាន់ទេ។',
    'when-enabled' => 'ពេលដែលអ្នកបើកការផ្ទៀងផ្ទាត់ពីរជាន់ អ្នកត្រូវបញ្ចូលកូដសុវត្ថិភាពដែលបង្កើតដោយកម្មវិធី Google Authenticator លើទូរស័ព្ទរបស់អ្នក។',
    'finish-enabling' => 'ដើម្បីបញ្ចប់ការបើកការផ្ទៀងផ្ទាត់ពីរជាន់ សូមស្កេន QR Code ឬបញ្ចូលកូនសោរ ហើយបញ្ចូលកូដ OTP។',
    'now-enabled' => 'បានបើកការផ្ទៀងផ្ទាត់ពីរជាន់រួចរាល់។ ស្កេន QR Code ឬបញ្ចូលកូនសោរ។',
    'setup-key' => 'កូនសោរ',
    'code' => 'កូដ',
    'Store-recovery-codes' => 'សូមរក្សារកូដស្ដារនេះក្នុងកម្មវិធីគ្រប់គ្រងពាក្យសម្ងាត់។ វាអាចប្រើស្ដារចូលទៅគណនីរបស់អ្នកវិញបាន។',
    'enable-btn' => 'បើក',
    'regenerate-recovery-codes-btn' => 'បង្កើតកូដស្ដារឡើងវិញ',
    'confirm-btn' => 'បញ្ជាក់',
    'show-recovery-codes-btn' => 'បង្ហាញកូដស្ដារ',
    'cancel-btn' => 'បោះបង់',
    'disable-btn' => 'បិទ',

    //------------------------------- Confirms-Password Component  ----------------------------- //
    'confirm-password' => 'បញ្ជាក់ពាក្យសម្ងាត់',
    'confirm-msg' => 'សូមបញ្ជាក់ពាក្យសម្ងាត់របស់អ្នក ដើម្បីបន្តធ្វើការដោយសុវត្ថិភាព។',
    'password' => 'ពាក្យសម្ងាត់',

    //------------------------ Update Password form Page ----------------------------- //
    'update-password' => 'ប្ដូរពាក្យសម្ងាត់',
    'secure-password' => 'សូមប្រាកដថាអ្នកប្រើពាក្យសម្ងាត់ដែលមានសុវត្ថិភាព និងចៃដន្យ។',
    'current-password' => 'ពាក្យសម្ងាត់បច្ចុប្បន្ន',
    'new-password' => 'ពាក្យសម្ងាត់ថ្មី',

    //------------------------ Logout Other Sessions form Page ----------------------------- //
    'browser-sessions' => 'សម័យកម្មកម្មវិធីរុករក',
    'manage-sessions-msg' => 'គ្រប់គ្រង និងចាកចេញពីសម័យកម្មនៅលើឧបករណ៍ផ្សេងទៀត។',
    'sessions-content' => 'បើចាំបាច់ អ្នកអាចចាកចេញពីសម័យកម្មនៅលើឧបករណ៍ទាំងអស់បាន។ សូមអាប់ដេតពាក្យសម្ងាត់ ប្រសិនបើអ្នកសង្ស័យថាគណនីរបស់អ្នកត្រូវបានលួច។',
    'unknown' => 'មិនស្គាល់',
    'this-device' => 'ឧបករណ៍នេះ',
    'last-active' => 'សកម្មចុងក្រោយ',
    'log-out-sessions-btn' => 'ចាកចេញពីសម័យកម្មផ្សេងទៀត',
    'password-confirm-to-log-out-sessions' => 'សូមបញ្ចូលពាក្យសម្ងាត់ ដើម្បីបញ្ជាក់ការចាកចេញពីឧបករណ៍ផ្សេងទៀត។',

    //------------------------ Delete Account form Page ----------------------------- //
    'delete-account' => 'លុបគណនី',
    'delete-account-msg' => 'លុបគណនីរបស់អ្នកជាអចិន្រ្តៃយ៍។',
    'delete-account-content' => 'បន្ទាប់ពីលុបគណនីរួច ទិន្នន័យទាំងអស់នឹងត្រូវបានលុបចោល។ សូមទាញយកទិន្នន័យមុនពេលលុប។',
    'delete-account-btn' => 'លុបគណនី',
    'delete-account-modal-content' => 'តើអ្នកប្រាកដហើយថាចង់លុបគណនីនេះមែនទេ? វានឹងលុបទិន្នន័យទាំងអស់។ សូមបញ្ចូលពាក្យសម្ងាត់ ដើម្បីបញ្ជាក់។',

];
